#### Terraform Plan (dev) 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_iam_policy_document.assume_eks-worker_role: Reading...
data.aws_iam_policy_document.assume_eks-worker_role: Read complete after 0s [id=2851119427]
data.aws_vpc.conquer-vpc: Reading...
data.aws_iam_policy_document.assume_eks_role: Reading...
data.aws_iam_policy_document.assume_eks_role: Read complete after 0s [id=3552664922]
data.aws_vpc.conquer-vpc: Read complete after 2s [id=vpc-0e724d4c7ed376ef9]
data.aws_subnets.eks_subnets: Reading...
data.aws_subnets.eks_subnets: Read complete after 0s [id=eu-north-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_security_group.eks-cluster-sg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_security_group" "eks-cluster-sg" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + tags        = (known after apply)
      + vpc_id      = (known after apply)

      + filter {
          + name   = "description"
          + values = [
              + "EKS created security group applied to ENI that is attached to EKS Control Plane master nodes, as well as any managed workloads.",
            ]
        }
    }

  # aws_eks_addon.example will be created
  + resource "aws_eks_addon" "example" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "dev-conquer-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "PRESERVE"
      + tags_all                    = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
    }

  # aws_eks_cluster.eks will be created
  + resource "aws_eks_cluster" "eks" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "dev-conquer-cluster"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "ctf" = "WW91IGdvdCBpdCEgbmljZS4="
        }
      + tags_all                  = {
          + "ctf"     = "WW91IGdvdCBpdCEgbmljZS4="
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + version                   = "1.27"

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = "10.100.0.0/16"
          + service_ipv6_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + subnet_ids                = [
              + "subnet-0355ff3c88d14c102",
              + "subnet-085e59a0866b87184",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.node-group["subnet-0355ff3c88d14c102"] will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "dev-conquer-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + node_group_name        = "dev-conquer-node-group-1"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0355ff3c88d14c102",
        ]
      + tags_all               = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 3
          + max_size     = 3
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_eks_node_group.node-group["subnet-085e59a0866b87184"] will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "dev-conquer-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + node_group_name        = "dev-conquer-node-group-0"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-085e59a0866b87184",
        ]
      + tags_all               = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 3
          + max_size     = 3
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_iam_role.eks_role will be created
  + resource "aws_iam_role" "eks_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-conquer-eks-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.eks_worker_role will be created
  + resource "aws_iam_role" "eks_worker_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-conquer-eks-worker-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "dev-conquer-eks-worker-role"
    }

  # aws_iam_role_policy_attachment.AmazonEC2RoleforSSM will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEC2RoleforSSM" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2RoleforSSM"
      + role       = "dev-conquer-eks-worker-role"
    }

  # aws_iam_role_policy_attachment.AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "dev-conquer-eks-role"
    }

  # aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "dev-conquer-eks-worker-role"
    }

  # aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "dev-conquer-eks-worker-role"
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + endpoint                              = (known after apply)
  + kubeconfig-certificate-authority-data = (sensitive value)
  + oidc-issuer                           = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"

```

</details>

*Pusher: @benhur-araujo, Action: `pull_request`, Working Directory: ``, Workflow: `create-ephemeral-resources`*